#### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame(data=[["Abhishek",33,"ICICI Bank",50000],["Nitesh",29,"Wipro",100000],["Aniket",34,"Ceat",120000],["Rahul",31,"TCS",150000],['Venkat',32,"Infosys",75000],['Pavan',30,'Tech mahindra',80000]],columns=['Name','Age','Company','Salary'])

In [3]:
df

       Name  Age        Company  Salary
0  Abhishek   33     ICICI Bank   50000
1    Nitesh   29          Wipro  100000
2    Aniket   34           Ceat  120000
3     Rahul   31            TCS  150000
4    Venkat   32        Infosys   75000
5     Pavan   30  Tech mahindra   80000

In [4]:
## df.head() will give first 5 rows

In [5]:
df.head()

       Name  Age     Company  Salary
0  Abhishek   33  ICICI Bank   50000
1    Nitesh   29       Wipro  100000
2    Aniket   34        Ceat  120000
3     Rahul   31         TCS  150000
4    Venkat   32     Infosys   75000

In [6]:
## df.tail() wil give last 5 rows

In [7]:
df.tail()

     Name  Age        Company  Salary
1  Nitesh   29          Wipro  100000
2  Aniket   34           Ceat  120000
3   Rahul   31            TCS  150000
4  Venkat   32        Infosys   75000
5   Pavan   30  Tech mahindra   80000

In [8]:
## df.nunique() will give unique count of values for each column

In [9]:
df.nunique()

Name       6
Age        6
Company    6
Salary     6
dtype: int64

In [10]:
## df.isnull() will result true if any null values in df

In [11]:
df.isnull()

    Name    Age  Company  Salary
0  False  False    False   False
1  False  False    False   False
2  False  False    False   False
3  False  False    False   False
4  False  False    False   False
5  False  False    False   False

In [12]:
## df.dtypes will give datatypes of columns

In [13]:
df.dtypes

Name       object
Age         int64
Company    object
Salary      int64
dtype: object

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#### DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [14]:
df1=pd.DataFrame(data=[["Abhishek",33,"ICICI Bank"],["Nitesh",29,"Wipro"],["Aniket",34,"Ceat"],["Rahul",31,"TCS"],['Venkat',32,"Infosys"],['Pavan',30,'Tech mahindra']],columns=['A','B','C'])

In [15]:
df1

          A   B              C
0  Abhishek  33     ICICI Bank
1    Nitesh  29          Wipro
2    Aniket  34           Ceat
3     Rahul  31            TCS
4    Venkat  32        Infosys
5     Pavan  30  Tech mahindra

In [16]:
df1[1::2]

        A   B              C
1  Nitesh  29          Wipro
3   Rahul  31            TCS
5   Pavan  30  Tech mahindra

In [17]:
df1=df1.reindex(range(1,2*len(df1),2))

In [18]:
df1

         A     B              C
1   Nitesh  29.0          Wipro
3    Rahul  31.0            TCS
5    Pavan  30.0  Tech mahindra
7      NaN   NaN            NaN
9      NaN   NaN            NaN
11     NaN   NaN            NaN

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#### iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#### function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [19]:
df2=pd.DataFrame(data=[10,20,30,40,50],columns=['Values'])

In [20]:
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [21]:
def sum_3(df_column):
    s=0
    cnt=1
    for i in df_column:
        if cnt>3:
            break
        else:
            s=s+i
            cnt=cnt+1
    return s

In [22]:
sum_3(df2['Values'])

60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#### 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [23]:
df_text=pd.DataFrame(data=['This is Pwskills','There are multiple courses in pwskills','I love Data Science course'],columns=['Text'])

In [24]:
df_text

                                     Text
0                        This is Pwskills
1  There are multiple courses in pwskills
2              I love Data Science course

In [25]:
def word_cnt(x):
    x=x.split()
    return len(x)

In [26]:
df_text['Word_Count']=df_text['Text'].apply(word_cnt)

In [27]:
df_text

                                     Text  Word_Count
0                        This is Pwskills           3
1  There are multiple courses in pwskills           6
2              I love Data Science course           5

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [28]:
## DataFrame.size() will return the number of total datacells in dataframe(ie.total rows*total columns)
## DataFrame.shape will return number of rows and number of columns in tuple format:(rows,columns)

In [29]:
df.size

24

In [30]:
df.shape

(6, 4)

#### Q6. Which function of pandas do we use to read an excel file?

In [31]:
## pd.read_excel('filepath') is used to read Excel file

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#### addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#### 'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [32]:
df_email=pd.DataFrame(data=['pwskills@gmail.com','rahul_maurya@yahoo.com','aniket.chavan21@gmail.com','venkatraman_88@outlook.com'],columns=['Email'])

In [33]:
df_email

                        Email
0          pwskills@gmail.com
1      rahul_maurya@yahoo.com
2   aniket.chavan21@gmail.com
3  venkatraman_88@outlook.com

In [34]:
def username_part(x):
    x=x.split('@')
    return x[0]

In [35]:
df_email['Username']=df_email['Email'].apply(username_part)

In [36]:
df_email

                        Email         Username
0          pwskills@gmail.com         pwskills
1      rahul_maurya@yahoo.com     rahul_maurya
2   aniket.chavan21@gmail.com  aniket.chavan21
3  venkatraman_88@outlook.com   venkatraman_88

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#### all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#### function should return a new DataFrame that contains only the selected rows.

In [37]:
df_abc=pd.DataFrame(data=[(3,5,1),(8,2,7),(6,9,4),(2,3,5),(9,1,2),(6,11,3)],columns=["A",'B','C'])

In [38]:
df_abc

   A   B  C
0  3   5  1
1  8   2  7
2  6   9  4
3  2   3  5
4  9   1  2
5  6  11  3

In [40]:
df_abc[df_abc['B']<10]

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [41]:
df_abc[df_abc['A']>5]

   A   B  C
1  8   2  7
2  6   9  4
4  9   1  2
5  6  11  3

In [43]:
df_updated=df_abc[df_abc['A']>5][df_abc['B']<10]

/tmp/ipykernel_102/3028568618.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_updated=df_abc[df_abc['A']>5][df_abc['B']<10]

In [44]:
df_updated

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
#### median, and standard deviation of the values in the 'Values' column.

In [51]:
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [46]:
df2['Values'].mean()

30.0

In [47]:
df2['Values'].std()

15.811388300841896

In [48]:
df2['Values'].median()

30.0

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#### create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#### for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#### should include the current day.

In [ ]:
## I have imported data for calculation ,Assume month

In [89]:
df_sales=pd.read_csv("perrin-freres-monthly-champagne.csv")

In [90]:
df_sales.head()

     Month  Perrin Freres monthly champagne sales millions ?64-?72
0  1964-01                                             2815.0
1  1964-02                                             2672.0
2  1964-03                                             2755.0
3  1964-04                                             2721.0
4  1964-05                                             2946.0

In [91]:
df_sales=df_sales.rename(columns={'Month':'Date','Perrin Freres monthly champagne sales millions ?64-?72':'Sales'})

In [92]:
df_sales=df_sales.dropna()

In [93]:
df_sales

        Date   Sales
0    1964-01  2815.0
1    1964-02  2672.0
2    1964-03  2755.0
3    1964-04  2721.0
4    1964-05  2946.0
..       ...     ...
100  1972-05  4618.0
101  1972-06  5312.0
102  1972-07  4298.0
103  1972-08  1413.0
104  1972-09  5877.0

[105 rows x 2 columns]

In [94]:
df_sales['MovingAverage']=df_sales['Sales'].rolling(7).mean()

In [95]:
df_sales.head(15)

       Date   Sales  MovingAverage
0   1964-01  2815.0            NaN
1   1964-02  2672.0            NaN
2   1964-03  2755.0            NaN
3   1964-04  2721.0            NaN
4   1964-05  2946.0            NaN
5   1964-06  3036.0            NaN
6   1964-07  2282.0    2746.714286
7   1964-08  2212.0    2660.571429
8   1964-09  2922.0    2696.285714
9   1964-10  4301.0    2917.142857
10  1964-11  5764.0    3351.857143
11  1964-12  7312.0    3975.571429
12  1965-01  2541.0    3904.857143
13  1965-02  2475.0    3932.428571
14  1965-03  3031.0    4049.428571

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#### column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
#### Monday, Tuesday) corresponding to each date in the 'Date' column.

In [98]:
df_sales.head()

      Date   Sales  MovingAverage
0  1964-01  2815.0            NaN
1  1964-02  2672.0            NaN
2  1964-03  2755.0            NaN
3  1964-04  2721.0            NaN
4  1964-05  2946.0            NaN

In [99]:
df_sales.dtypes

Date              object
Sales            float64
MovingAverage    float64
dtype: object

In [100]:
df_sales['Date']=pd.to_datetime(df_sales['Date'])

In [101]:
df_sales.dtypes

Date             datetime64[ns]
Sales                   float64
MovingAverage           float64
dtype: object

In [102]:
df_sales.head()

        Date   Sales  MovingAverage
0 1964-01-01  2815.0            NaN
1 1964-02-01  2672.0            NaN
2 1964-03-01  2755.0            NaN
3 1964-04-01  2721.0            NaN
4 1964-05-01  2946.0            NaN

In [108]:
df_sales['day_of_week']=df_sales['Date'].dt.weekday

In [109]:
df_sales.head()

        Date   Sales  MovingAverage  day_of_week
0 1964-01-01  2815.0            NaN            2
1 1964-02-01  2672.0            NaN            5
2 1964-03-01  2755.0            NaN            6
3 1964-04-01  2721.0            NaN            2
4 1964-05-01  2946.0            NaN            4

In [111]:
def weekday_fun(x):
    if x==0:
        return "Monday"
    elif x==1:
        return "Tuesday"
    elif x==2:
        return "Wednesday"
    elif x==3:
        return "Thursday"
    elif x==4:
        return "Friday"
    elif x==5:
        return "Saturday"
    else:
        return "Sunday"

In [112]:
df_sales['day_of_week'].apply(weekday_fun)

0      Wednesday
1       Saturday
2         Sunday
3      Wednesday
4         Friday
         ...
100       Monday
101     Thursday
102     Saturday
103      Tuesday
104       Friday
Name: day_of_week, Length: 105, dtype: object

In [113]:
df_sales['WeekDay']=df_sales['day_of_week'].apply(weekday_fun)

In [114]:
df_sales.head()

        Date   Sales  MovingAverage  day_of_week    WeekDay
0 1964-01-01  2815.0            NaN            2  Wednesday
1 1964-02-01  2672.0            NaN            5   Saturday
2 1964-03-01  2755.0            NaN            6     Sunday
3 1964-04-01  2721.0            NaN            2  Wednesday
4 1964-05-01  2946.0            NaN            4     Friday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
#### function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [116]:
data = pd.date_range(start = '2022-12-22' ,end = '2023-02-20')

In [121]:
df_date=pd.DataFrame({"Date":data})

In [129]:
df_date

         Date
0  2022-12-22
1  2022-12-23
2  2022-12-24
3  2022-12-25
4  2022-12-26
..        ...
56 2023-02-16
57 2023-02-17
58 2023-02-18
59 2023-02-19
60 2023-02-20

[61 rows x 1 columns]

In [123]:
df_date.dtypes

Date    datetime64[ns]
dtype: object

In [127]:
df_date[(df_date['Date']>='2023-01-01')][(df_date['Date']<='2023-01-31')]

/tmp/ipykernel_102/105093334.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_date[(df_date['Date']>='2023-01-01')][(df_date['Date']<='2023-01-31')]

         Date
10 2023-01-01
11 2023-01-02
12 2023-01-03
13 2023-01-04
14 2023-01-05
15 2023-01-06
16 2023-01-07
17 2023-01-08
18 2023-01-09
19 2023-01-10
20 2023-01-11
21 2023-01-12
22 2023-01-13
23 2023-01-14
24 2023-01-15
25 2023-01-16
26 2023-01-17
27 2023-01-18
28 2023-01-19
29 2023-01-20
30 2023-01-21
31 2023-01-22
32 2023-01-23
33 2023-01-24
34 2023-01-25
35 2023-01-26
36 2023-01-27
37 2023-01-28
38 2023-01-29
39 2023-01-30
40 2023-01-31

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [130]:
### for using function of pandas we need to import pandas library